app/Controllers/Produtos.php

SELECT *
FROM `produtos`
---
    public function list()
    {
      $data = $this->produtoModel->findAll();